docs/load-test/20260130-090818-redis.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: infra/k6/scripts/allocation-status-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 2m30s max duration (incl. graceful stop):
              * load_test: Up to 1000 looping VUs for 2m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 0031/1000 VUs, 0 complete and 0 interrupted iterations
load_test   [   1% ] 0031/1000 VUs  0m00.9s/2m00.0s

running (0m01.9s), 0064/1000 VUs, 0 complete and 0 interrupted iterations
load_test   [   2% ] 0064/1000 VUs  0m01.9s/2m00.0s

running (0m02.9s), 0097/1000 VUs, 63 complete and 0 interrupted iterations
load_test   [   2% ] 0097/1000 VUs  0m02.9s/2m00.0s

running (0m03.9s), 0131/1000 VUs, 158 complete and 0 interrupted iterations
load_test   [   3% ] 0131/1000 VUs  0m03.9s/2m00.0s

running (0m04.9s), 0164/1000 VUs, 288 complete and 0 interrupted iterations
load_test   [   4% ] 0164/1000 VUs  0m04.9s/2m00.0s

running (0m05.9s), 0197/1000 VUs, 447 complete and 0 interrupted iterations
load_test   [   5% ] 0197/1000 VUs  0m05.9s/2m00.0s

running (0m06.9s), 0231/1000 VUs, 642 complete and 0 interrupted iterations
load_test   [   6% ] 0231/1000 VUs  0m06.9s/2m00.0s

running (0m07.9s), 0264/1000 VUs, 868 complete and 0 interrupted iterations
load_test   [   7% ] 0264/1000 VUs  0m07.9s/2m00.0s

running (0m08.9s), 0297/1000 VUs, 1124 complete and 0 interrupted iterations
load_test   [   7% ] 0297/1000 VUs  0m08.9s/2m00.0s

running (0m09.9s), 0331/1000 VUs, 1418 complete and 0 interrupted iterations
load_test   [   8% ] 0331/1000 VUs  0m09.9s/2m00.0s

running (0m10.9s), 0364/1000 VUs, 1741 complete and 0 interrupted iterations
load_test   [   9% ] 0364/1000 VUs  0m10.9s/2m00.0s

running (0m11.9s), 0397/1000 VUs, 2098 complete and 0 interrupted iterations
load_test   [  10% ] 0397/1000 VUs  0m11.9s/2m00.0s

running (0m12.9s), 0431/1000 VUs, 2488 complete and 0 interrupted iterations
load_test   [  11% ] 0431/1000 VUs  0m12.9s/2m00.0s

running (0m13.9s), 0464/1000 VUs, 2907 complete and 0 interrupted iterations
load_test   [  12% ] 0464/1000 VUs  0m13.9s/2m00.0s

running (0m14.9s), 0497/1000 VUs, 3366 complete and 0 interrupted iterations
load_test   [  12% ] 0497/1000 VUs  0m14.9s/2m00.0s

running (0m15.9s), 0531/1000 VUs, 3853 complete and 0 interrupted iterations
load_test   [  13% ] 0531/1000 VUs  0m15.9s/2m00.0s

running (0m16.9s), 0564/1000 VUs, 4366 complete and 0 interrupted iterations
load_test   [  14% ] 0564/1000 VUs  0m16.9s/2m00.0s

running (0m17.9s), 0597/1000 VUs, 4917 complete and 0 interrupted iterations
load_test   [  15% ] 0597/1000 VUs  0m17.9s/2m00.0s

running (0m18.9s), 0631/1000 VUs, 5471 complete and 0 interrupted iterations
load_test   [  16% ] 0631/1000 VUs  0m18.9s/2m00.0s

running (0m19.9s), 0664/1000 VUs, 6070 complete and 0 interrupted iterations
load_test   [  17% ] 0664/1000 VUs  0m19.9s/2m00.0s

running (0m20.9s), 0697/1000 VUs, 6709 complete and 0 interrupted iterations
load_test   [  17% ] 0697/1000 VUs  0m20.9s/2m00.0s

running (0m21.9s), 0731/1000 VUs, 7366 complete and 0 interrupted iterations
load_test   [  18% ] 0731/1000 VUs  0m21.9s/2m00.0s

running (0m22.9s), 0764/1000 VUs, 8073 complete and 0 interrupted iterations
load_test   [  19% ] 0764/1000 VUs  0m22.9s/2m00.0s

running (0m23.9s), 0797/1000 VUs, 8785 complete and 0 interrupted iterations
load_test   [  20% ] 0797/1000 VUs  0m23.9s/2m00.0s

running (0m24.9s), 0831/1000 VUs, 9533 complete and 0 interrupted iterations
load_test   [  21% ] 0831/1000 VUs  0m24.9s/2m00.0s

running (0m25.9s), 0864/1000 VUs, 10299 complete and 0 interrupted iterations
load_test   [  22% ] 0864/1000 VUs  0m25.9s/2m00.0s

running (0m26.9s), 0897/1000 VUs, 11052 complete and 0 interrupted iterations
load_test   [  22% ] 0897/1000 VUs  0m26.9s/2m00.0s

running (0m27.9s), 0931/1000 VUs, 11807 complete and 0 interrupted iterations
load_test   [  23% ] 0931/1000 VUs  0m27.9s/2m00.0s

running (0m28.9s), 0964/1000 VUs, 12588 complete and 0 interrupted iterations
load_test   [  24% ] 0964/1000 VUs  0m28.9s/2m00.0s

running (0m29.9s), 0997/1000 VUs, 13363 complete and 0 interrupted iterations
load_test   [  25% ] 0997/1000 VUs  0m29.9s/2m00.0s

running (0m30.9s), 1000/1000 VUs, 14147 complete and 0 interrupted iterations
load_test   [  26% ] 1000/1000 VUs  0m30.9s/2m00.0s

running (0m31.9s), 1000/1000 VUs, 14892 complete and 0 interrupted iterations
load_test   [  27% ] 1000/1000 VUs  0m31.9s/2m00.0s

running (0m32.9s), 1000/1000 VUs, 15613 complete and 0 interrupted iterations
load_test   [  27% ] 1000/1000 VUs  0m32.9s/2m00.0s

running (0m33.9s), 1000/1000 VUs, 16382 complete and 0 interrupted iterations
load_test   [  28% ] 1000/1000 VUs  0m33.9s/2m00.0s

running (0m34.9s), 1000/1000 VUs, 17167 complete and 0 interrupted iterations
load_test   [  29% ] 1000/1000 VUs  0m34.9s/2m00.0s

running (0m35.9s), 1000/1000 VUs, 17958 complete and 0 interrupted iterations
load_test   [  30% ] 1000/1000 VUs  0m35.9s/2m00.0s

running (0m36.9s), 1000/1000 VUs, 18701 complete and 0 interrupted iterations
load_test   [  31% ] 1000/1000 VUs  0m36.9s/2m00.0s

running (0m37.9s), 1000/1000 VUs, 19473 complete and 0 interrupted iterations
load_test   [  32% ] 1000/1000 VUs  0m37.9s/2m00.0s

running (0m38.9s), 1000/1000 VUs, 20098 complete and 0 interrupted iterations
load_test   [  32% ] 1000/1000 VUs  0m38.9s/2m00.0s

running (0m39.9s), 1000/1000 VUs, 20927 complete and 0 interrupted iterations
load_test   [  33% ] 1000/1000 VUs  0m39.9s/2m00.0s

running (0m40.9s), 1000/1000 VUs, 21778 complete and 0 interrupted iterations
load_test   [  34% ] 1000/1000 VUs  0m40.9s/2m00.0s

running (0m41.9s), 1000/1000 VUs, 22525 complete and 0 interrupted iterations
load_test   [  35% ] 1000/1000 VUs  0m41.9s/2m00.0s

running (0m42.9s), 1000/1000 VUs, 23325 complete and 0 interrupted iterations
load_test   [  36% ] 1000/1000 VUs  0m42.9s/2m00.0s

running (0m43.9s), 1000/1000 VUs, 24061 complete and 0 interrupted iterations
load_test   [  37% ] 1000/1000 VUs  0m43.9s/2m00.0s

running (0m44.9s), 1000/1000 VUs, 24827 complete and 0 interrupted iterations
load_test   [  37% ] 1000/1000 VUs  0m44.9s/2m00.0s

running (0m45.9s), 1000/1000 VUs, 25571 complete and 0 interrupted iterations
load_test   [  38% ] 1000/1000 VUs  0m45.9s/2m00.0s

running (0m46.9s), 1000/1000 VUs, 26241 complete and 0 interrupted iterations
load_test   [  39% ] 1000/1000 VUs  0m46.9s/2m00.0s

running (0m47.9s), 1000/1000 VUs, 27198 complete and 0 interrupted iterations
load_test   [  40% ] 1000/1000 VUs  0m47.9s/2m00.0s

running (0m48.9s), 1000/1000 VUs, 27967 complete and 0 interrupted iterations
load_test   [  41% ] 1000/1000 VUs  0m48.9s/2m00.0s

running (0m49.9s), 1000/1000 VUs, 28673 complete and 0 interrupted iterations
load_test   [  42% ] 1000/1000 VUs  0m49.9s/2m00.0s

running (0m50.9s), 1000/1000 VUs, 29485 complete and 0 interrupted iterations
load_test   [  42% ] 1000/1000 VUs  0m50.9s/2m00.0s

running (0m51.9s), 1000/1000 VUs, 30231 complete and 0 interrupted iterations
load_test   [  43% ] 1000/1000 VUs  0m51.9s/2m00.0s

running (0m52.9s), 1000/1000 VUs, 31096 complete and 0 interrupted iterations
load_test   [  44% ] 1000/1000 VUs  0m52.9s/2m00.0s

running (0m53.9s), 1000/1000 VUs, 31929 complete and 0 interrupted iterations
load_test   [  45% ] 1000/1000 VUs  0m53.9s/2m00.0s

running (0m54.9s), 1000/1000 VUs, 32666 complete and 0 interrupted iterations
load_test   [  46% ] 1000/1000 VUs  0m54.9s/2m00.0s

running (0m55.9s), 1000/1000 VUs, 33411 complete and 0 interrupted iterations
load_test   [  47% ] 1000/1000 VUs  0m55.9s/2m00.0s

running (0m56.9s), 1000/1000 VUs, 34281 complete and 0 interrupted iterations
load_test   [  47% ] 1000/1000 VUs  0m56.9s/2m00.0s

running (0m57.9s), 1000/1000 VUs, 35037 complete and 0 interrupted iterations
load_test   [  48% ] 1000/1000 VUs  0m57.9s/2m00.0s

running (0m58.9s), 1000/1000 VUs, 35796 complete and 0 interrupted iterations
load_test   [  49% ] 1000/1000 VUs  0m58.9s/2m00.0s

running (0m59.9s), 1000/1000 VUs, 36630 complete and 0 interrupted iterations
load_test   [  50% ] 1000/1000 VUs  0m59.9s/2m00.0s

running (1m00.9s), 1000/1000 VUs, 37402 complete and 0 interrupted iterations
load_test   [  51% ] 1000/1000 VUs  1m00.9s/2m00.0s

running (1m01.9s), 1000/1000 VUs, 38142 complete and 0 interrupted iterations
load_test   [  52% ] 1000/1000 VUs  1m01.9s/2m00.0s

running (1m02.9s), 1000/1000 VUs, 39034 complete and 0 interrupted iterations
load_test   [  52% ] 1000/1000 VUs  1m02.9s/2m00.0s

running (1m03.9s), 1000/1000 VUs, 39816 complete and 0 interrupted iterations
load_test   [  53% ] 1000/1000 VUs  1m03.9s/2m00.0s

running (1m04.9s), 1000/1000 VUs, 40550 complete and 0 interrupted iterations
load_test   [  54% ] 1000/1000 VUs  1m04.9s/2m00.0s

running (1m05.9s), 1000/1000 VUs, 41330 complete and 0 interrupted iterations
load_test   [  55% ] 1000/1000 VUs  1m05.9s/2m00.0s

running (1m06.9s), 1000/1000 VUs, 42216 complete and 0 interrupted iterations
load_test   [  56% ] 1000/1000 VUs  1m06.9s/2m00.0s

running (1m07.9s), 1000/1000 VUs, 42963 complete and 0 interrupted iterations
load_test   [  57% ] 1000/1000 VUs  1m07.9s/2m00.0s

running (1m08.9s), 1000/1000 VUs, 43685 complete and 0 interrupted iterations
load_test   [  57% ] 1000/1000 VUs  1m08.9s/2m00.0s

running (1m09.9s), 1000/1000 VUs, 44508 complete and 0 interrupted iterations
load_test   [  58% ] 1000/1000 VUs  1m09.9s/2m00.0s

running (1m10.9s), 1000/1000 VUs, 45352 complete and 0 interrupted iterations
load_test   [  59% ] 1000/1000 VUs  1m10.9s/2m00.0s

running (1m11.9s), 1000/1000 VUs, 46162 complete and 0 interrupted iterations
load_test   [  60% ] 1000/1000 VUs  1m11.9s/2m00.0s

running (1m12.9s), 1000/1000 VUs, 46953 complete and 0 interrupted iterations
load_test   [  61% ] 1000/1000 VUs  1m12.9s/2m00.0s

running (1m13.9s), 1000/1000 VUs, 47741 complete and 0 interrupted iterations
load_test   [  62% ] 1000/1000 VUs  1m13.9s/2m00.0s

running (1m14.9s), 1000/1000 VUs, 48449 complete and 0 interrupted iterations
load_test   [  62% ] 1000/1000 VUs  1m14.9s/2m00.0s

running (1m15.9s), 1000/1000 VUs, 49258 complete and 0 interrupted iterations
load_test   [  63% ] 1000/1000 VUs  1m15.9s/2m00.0s

running (1m16.9s), 1000/1000 VUs, 50056 complete and 0 interrupted iterations
load_test   [  64% ] 1000/1000 VUs  1m16.9s/2m00.0s

running (1m17.9s), 1000/1000 VUs, 50832 complete and 0 interrupted iterations
load_test   [  65% ] 1000/1000 VUs  1m17.9s/2m00.0s

running (1m18.9s), 1000/1000 VUs, 51597 complete and 0 interrupted iterations
load_test   [  66% ] 1000/1000 VUs  1m18.9s/2m00.0s

running (1m19.9s), 1000/1000 VUs, 52350 complete and 0 interrupted iterations
load_test   [  67% ] 1000/1000 VUs  1m19.9s/2m00.0s

running (1m20.9s), 1000/1000 VUs, 53255 complete and 0 interrupted iterations
load_test   [  67% ] 1000/1000 VUs  1m20.9s/2m00.0s

running (1m21.9s), 1000/1000 VUs, 53984 complete and 0 interrupted iterations
load_test   [  68% ] 1000/1000 VUs  1m21.9s/2m00.0s

running (1m22.9s), 1000/1000 VUs, 54718 complete and 0 interrupted iterations
load_test   [  69% ] 1000/1000 VUs  1m22.9s/2m00.0s

running (1m23.9s), 1000/1000 VUs, 55638 complete and 0 interrupted iterations
load_test   [  70% ] 1000/1000 VUs  1m23.9s/2m00.0s

running (1m24.9s), 1000/1000 VUs, 56429 complete and 0 interrupted iterations
load_test   [  71% ] 1000/1000 VUs  1m24.9s/2m00.0s

running (1m25.9s), 1000/1000 VUs, 57147 complete and 0 interrupted iterations
load_test   [  72% ] 1000/1000 VUs  1m25.9s/2m00.0s

running (1m26.9s), 1000/1000 VUs, 57971 complete and 0 interrupted iterations
load_test   [  72% ] 1000/1000 VUs  1m26.9s/2m00.0s

running (1m27.9s), 1000/1000 VUs, 58739 complete and 0 interrupted iterations
load_test   [  73% ] 1000/1000 VUs  1m27.9s/2m00.0s

running (1m28.9s), 1000/1000 VUs, 59470 complete and 0 interrupted iterations
load_test   [  74% ] 1000/1000 VUs  1m28.9s/2m00.0s

running (1m29.9s), 1000/1000 VUs, 60370 complete and 0 interrupted iterations
load_test   [  75% ] 1000/1000 VUs  1m29.9s/2m00.0s

running (1m30.9s), 0993/1000 VUs, 61019 complete and 0 interrupted iterations
load_test   [  76% ] 0993/1000 VUs  1m30.9s/2m00.0s

running (1m31.9s), 0950/1000 VUs, 61982 complete and 0 interrupted iterations
load_test   [  77% ] 0950/1000 VUs  1m31.9s/2m00.0s

running (1m32.9s), 0925/1000 VUs, 62733 complete and 0 interrupted iterations
load_test   [  77% ] 0925/1000 VUs  1m32.9s/2m00.0s

running (1m33.9s), 0887/1000 VUs, 63454 complete and 0 interrupted iterations
load_test   [  78% ] 0887/1000 VUs  1m33.9s/2m00.0s

running (1m34.9s), 0849/1000 VUs, 64321 complete and 0 interrupted iterations
load_test   [  79% ] 0849/1000 VUs  1m34.9s/2m00.0s

running (1m35.9s), 0823/1000 VUs, 65060 complete and 0 interrupted iterations
load_test   [  80% ] 0823/1000 VUs  1m35.9s/2m00.0s

running (1m36.9s), 0782/1000 VUs, 65859 complete and 0 interrupted iterations
load_test   [  81% ] 0782/1000 VUs  1m36.9s/2m00.0s

running (1m37.9s), 0752/1000 VUs, 66613 complete and 0 interrupted iterations
load_test   [  82% ] 0752/1000 VUs  1m37.9s/2m00.0s

running (1m38.9s), 0715/1000 VUs, 67347 complete and 0 interrupted iterations
load_test   [  82% ] 0715/1000 VUs  1m38.9s/2m00.0s

running (1m39.9s), 0689/1000 VUs, 68048 complete and 0 interrupted iterations
load_test   [  83% ] 0689/1000 VUs  1m39.9s/2m00.0s

running (1m40.9s), 0656/1000 VUs, 68721 complete and 0 interrupted iterations
load_test   [  84% ] 0656/1000 VUs  1m40.9s/2m00.0s

running (1m41.9s), 0617/1000 VUs, 69360 complete and 0 interrupted iterations
load_test   [  85% ] 0617/1000 VUs  1m41.9s/2m00.0s

running (1m42.9s), 0591/1000 VUs, 69961 complete and 0 interrupted iterations
load_test   [  86% ] 0591/1000 VUs  1m42.9s/2m00.0s

running (1m43.9s), 0552/1000 VUs, 70535 complete and 0 interrupted iterations
load_test   [  87% ] 0552/1000 VUs  1m43.9s/2m00.0s

running (1m44.9s), 0520/1000 VUs, 71075 complete and 0 interrupted iterations
load_test   [  87% ] 0520/1000 VUs  1m44.9s/2m00.0s

running (1m45.9s), 0486/1000 VUs, 71580 complete and 0 interrupted iterations
load_test   [  88% ] 0486/1000 VUs  1m45.9s/2m00.0s

running (1m46.9s), 0455/1000 VUs, 72056 complete and 0 interrupted iterations
load_test   [  89% ] 0455/1000 VUs  1m46.9s/2m00.0s

running (1m47.9s), 0424/1000 VUs, 72496 complete and 0 interrupted iterations
load_test   [  90% ] 0424/1000 VUs  1m47.9s/2m00.0s

running (1m48.9s), 0388/1000 VUs, 72912 complete and 0 interrupted iterations
load_test   [  91% ] 0388/1000 VUs  1m48.9s/2m00.0s

running (1m49.9s), 0357/1000 VUs, 73295 complete and 0 interrupted iterations
load_test   [  92% ] 0357/1000 VUs  1m49.9s/2m00.0s

running (1m50.9s), 0320/1000 VUs, 73646 complete and 0 interrupted iterations
load_test   [  92% ] 0320/1000 VUs  1m50.9s/2m00.0s

running (1m51.9s), 0288/1000 VUs, 73961 complete and 0 interrupted iterations
load_test   [  93% ] 0288/1000 VUs  1m51.9s/2m00.0s

running (1m52.9s), 0255/1000 VUs, 74242 complete and 0 interrupted iterations
load_test   [  94% ] 0255/1000 VUs  1m52.9s/2m00.0s

running (1m53.9s), 0222/1000 VUs, 74493 complete and 0 interrupted iterations
load_test   [  95% ] 0222/1000 VUs  1m53.9s/2m00.0s

running (1m54.9s), 0186/1000 VUs, 74712 complete and 0 interrupted iterations
load_test   [  96% ] 0186/1000 VUs  1m54.9s/2m00.0s

running (1m55.9s), 0154/1000 VUs, 74897 complete and 0 interrupted iterations
load_test   [  97% ] 0154/1000 VUs  1m55.9s/2m00.0s

running (1m56.9s), 0116/1000 VUs, 75048 complete and 0 interrupted iterations
load_test   [  97% ] 0116/1000 VUs  1m56.9s/2m00.0s

running (1m57.9s), 0087/1000 VUs, 75162 complete and 0 interrupted iterations
load_test   [  98% ] 0087/1000 VUs  1m57.9s/2m00.0s

running (1m58.9s), 0053/1000 VUs, 75247 complete and 0 interrupted iterations
load_test   [  99% ] 0053/1000 VUs  1m58.9s/2m00.0s

running (1m59.9s), 0023/1000 VUs, 75300 complete and 0 interrupted iterations
load_test   [ 100% ] 0023/1000 VUs  1m59.9s/2m00.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1000' p(95)=580.37ms
    ✓ 'p(99)<5000' p(99)=994.43ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 150646 1248.174843/s
    checks_succeeded...: 99.51% 149914 out of 150646
    checks_failed......: 0.48%  732 out of 150646

    ✓ status is 200
    ✗ response time < 1000ms
      ↳  99% — ✓ 74591 / ✗ 732

    HTTP
    http_req_duration..............: avg=201.39ms min=6.71ms med=146.54ms max=4.36s p(90)=460.7ms p(95)=580.37ms
      { expected_response:true }...: avg=201.39ms min=6.71ms med=146.54ms max=4.36s p(90)=460.7ms p(95)=580.37ms
    http_req_failed................: 0.00%  0 out of 75323
    http_reqs......................: 75323  624.087421/s

    EXECUTION
    iteration_duration.............: avg=1.2s     min=1s     med=1.14s    max=5.36s p(90)=1.46s   p(95)=1.58s   
    iterations.....................: 75323  624.087421/s
    vus............................: 23     min=23         max=1000
    vus_max........................: 1000   min=1000       max=1000

    NETWORK
    data_received..................: 990 MB 8.2 MB/s
    data_sent......................: 8.3 MB 69 kB/s



running (2m00.7s), 0000/1000 VUs, 75323 complete and 0 interrupted iterations
load_test ✓ [ 100% ] 0000/1000 VUs  2m0s